import java.io.*;
import java.util.UUID;


public class Generator {


    public static void main(String[] args) throws IOException, ArrayIndexOutOfBoundsException {
        //все, что так или иначе изменяется в файлах
        String no;
        String inn;
        String kpp;
        if (args.length>0) no = args[0];
        else no = "0087";
        System.out.println(no);

        if (args.length>2) {
            inn = args[1];
            kpp = args[2];
        }
        else {
            inn = "7703376553";
            kpp = "770301001";
        }
        System.out.println("INN = "+inn+" KPP = "+kpp);

        int nomKorr = 0;
        String sum = "6666666.66";
        UUID guid = UUID.randomUUID();

        String basePath = new File("").getAbsolutePath();
        System.out.println(basePath);

        String path = basePath + "\\files_" + no + "_v" +nomKorr + "_" + guid;
        String common = no+"_"+no+"_"+inn+kpp+"_20200510_"+guid;
        File dir = new File(basePath, ("files_" + no + "_v" +nomKorr + "_" + guid));
        File nd = new File(dir, ("NO_NDS_"+common+".xml"));
        File nd8 = new File(dir, ("NO_NDS.8_"+common+".xml"));
        File nd9 = new File(dir, ("NO_NDS.9_"+common+".xml"));
        File reestr = new File(dir, ("KO_RRTDNDS_"+common+".xml"));
        File reestr2 = new File(dir, ("KO_RRTDNDS.2_"+common+".xml"));

        System.out.println(path);
        System.out.println(common);

//создание директории и файлов
        dir.mkdir();
        nd.createNewFile();
        nd8.createNewFile();
        nd9.createNewFile();
        reestr.createNewFile();
        reestr2.createNewFile();

        //наполнение файлов дребеденью
        //пока без разных сумм, сил на это нет и необходимости
        //ПЕРВИЧКА
        String fw = "<?xml version=\"1.0\" encoding=\"windows-1251\"?>\n"+
                "<Файл ИдФайл=\""+nd.getName().replaceFirst("[.][^.]+$", "")+"\" ВерсПрог=\"КОНТУР-ЭКСТЕРН, ВЕРСИЯ 14.0\" ВерсФорм=\"5.06\" ПризнНал8-12=\"1\" ПризнНал8=\"1\" ПризнНал81=\"0\" ПризнНал9=\"1\" ПризнНал91=\"0\" ПризнНал10=\"0\" ПризнНал11=\"0\" ПризнНал12=\"0\">\n"+
                "\t<Документ КНД=\"1151001\" ДатаДок=\"10.05.2020\" Период=\"24\" ОтчетГод=\"2019\" КодНО=\""+no+"\" НомКорр=\""+nomKorr+"\" ПоМесту=\"214\">\n" +
                "\t\t<СвНП ОКВЭД=\"41.20\">\n" +
                "\t\t\t<НПЮЛ НаимОрг=\"АО РОССИЙСКИЙ ЭКСПОРТНЫЙ ЦЕНТР\" ИННЮЛ=\""+inn+"\" КПП=\""+kpp+"\"/>\n"+
                "\t\t</СвНП>\n" +
                "\t\t<Подписант ПрПодп=\"1\">\n" +
                "\t\t\t<ФИО Фамилия=\"Богданов\" Имя=\"Иван\" Отчество=\"Иосифович\"/>\n" +
                "\t\t</Подписант>\n" +
                "\t\t<НДС>\n" +
                "\t\t\t<СумУплНП ОКТМО=\"77000000\" КБК=\"18210301000011000110\" СумПУ_173.1=\"0\"/>\n" +
                "\t\t\t<НалПодтв0 СумИсчислИтог=\"0\">\n" +
                "\t\t\t\t<СумОпер4 КодОпер=\"1011410\" НалБаза=\"43687789\"/>\n" +
                "\t\t\t\t<СумОпер4 КодОпер=\"1010410\" НалБаза=\"9857667419\"/>\n" +
                "\t\t\t</НалПодтв0>\n" +
                "\t\t\t<КнигаПокуп НаимКнПок=\""+nd8.getName()+"\"/>\n" +
                "\t\t\t<КнигаПрод НаимКнПрод=\""+nd9.getName()+"\"/>\n" +
                "\t\t</НДС>\n" +
                "\t</Документ>\n" +
                "</Файл>";

        String fw1 = "<?xml version=\"1.0\" encoding=\"windows-1251\"?>\n" +
                "<Файл ИдФайл=\""+nd8.getName().replaceFirst("[.][^.]+$", "")+"\" ВерсПрог=\"КОНТУР-ЭКСТЕРН, ВЕРСИЯ 14.0\" ВерсФорм=\"5.06\">\n" +
                "\t<Документ Индекс=\"0000080\" НомКорр=\""+nomKorr+"\">\n" +
                "\t\t<КнигаПокуп СумНДСВсКПк=\"0\">\n" +
                "\t\t\t<КнПокСтр НомерПор=\"1\" НомСчФПрод=\"10\" ДатаСчФПрод=\"05.12.2019\" СтоимПокупВ=\"100\" СумНДСВыч=\"0\">\n" +
                "\t\t\t\t<КодВидОпер>26</КодВидОпер>\n" +
                "\t\t\t\t<ДатаУчТов>05.12.2019</ДатаУчТов>\n" +
                "\t\t\t\t<СвПрод>\n" +
                "\t\t\t\t\t<СведЮЛ ИННЮЛ=\"6699000000\" КПП=\"669901001\"/>\n" +
                "\t\t\t\t</СвПрод>\n" +
                "\t\t\t</КнПокСтр>\n" +
                "\t\t</КнигаПокуп>\n" +
                "\t</Документ>\n" +
                "</Файл>";

        String fw2 = "<?xml version=\"1.0\" encoding=\"windows-1251\"?>\n" +
                "<Файл ИдФайл=\""+nd9.getName().replaceFirst("[.][^.]+$", "")+"\" ВерсПрог=\"КОНТУР-ЭКСТЕРН, ВЕРСИЯ 14.0\" ВерсФорм=\"5.06\">\n" +
                "\t<Документ Индекс=\"0000090\" НомКорр=\""+nomKorr+"\">\n" +
                "\t\t<КнигаПрод СтПродБезНДС18=\"100\" СтПродБезНДС10=\"0\" СтПродБезНДС0=\"0\" СумНДСВсКПр18=\"0\" СумНДСВсКПр10=\"0\">\n" +
                "\t\t\t<КнПродСтр НомерПор=\"1\" НомСчФПрод=\"10\" ДатаСчФПрод=\"07.12.2019\" ОКВ=\"643\" СтоимПродСФ=\"100\" СтоимПродСФ18=\"100\" СумНДССФ18=\"0\">\n" +
                "\t\t\t\t<КодВидОпер>01</КодВидОпер>\n" +
                "\t\t\t</КнПродСтр>\n" +
                "\t\t</КнигаПрод>\n" +
                "\t</Документ>\n" +
                "</Файл>";

        String fw3 = "<?xml version=\"1.0\" encoding=\"windows-1251\"?>\n" +
                "<Файл xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" ИдФайл=\""+reestr.getName().replaceFirst("[.][^.]+$", "")+"\" ВерсПрог=\"Налогоплательщик ЮЛ 4.66\" ВерсФорм=\"5.03\">\n" +
                "\t<Документ КНД=\"1155110\" ДатаДок=\"10.05.2020\" КодНО=\""+no+"\" Период=\"24\" ОтчетГод=\"2019\" ИмяФайлНДС=\""+nd.getName().replaceFirst("[.][^.]+$", "")+"\" НомКорр=\""+nomKorr+"\" НаимРеестрТД_1=\""+reestr2.getName()+"\">\n" +
                "\t\t<СвНП>\n" +
                "\t\t\t<НПЮЛ НаимОрг=\"АО РОССИЙСКИЙ ЭКСПОРТНЫЙ ЦЕНТР\" ИННЮЛ=\""+inn+"\" КПП=\""+kpp+"\"/>\n" +
                "\t\t</СвНП>\n" +
                "\t\t<Подписант ПрПодп=\"1\" Тлф=\"88005553535\">\n" +
                "\t\t\t<ФИО Фамилия=\"Богданов\" Имя=\"Иван\" Отчество=\"Иосифович\"/>\n" +
                "\t\t</Подписант>\n" +
                "\t\t<РеестрТД_1 КодОпер=\"1011410\" НалБазаИт=\"43687789\"/>\n" +
                "\t\t<РеестрТД_1 КодОпер=\"1010410\" НалБазаИт=\"9857667419\"/>\n" +
                "\t</Документ>\n" +
                "</Файл>\n";

        String fw4 = "<?xml version=\"1.0\" encoding=\"windows-1251\"?>\n" +
                "<Файл xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" ИдФайл=\""+reestr2.getName().replaceFirst("[.][^.]+$", "")+"\" ВерсПрог=\"Налогоплательщик ЮЛ 4.66\" ВерсФорм=\"5.03\">\n" +
                "\t<Документ Индекс=\"0005110\" НомКорр=\""+nomKorr+"\">\n" +
                "\t\t<РеестрТД_1 КодОпер=\"1011410\" НалБазаИт=\"43687789\">\n" +
                "\t\t\t<СведТД НомПор=\"1\" РегНомТД=\"121321124432536780p9876543678\" НалБазаОпПдтв=\"433425.41\"/>\n" +
                "\t\t\t<СведТД НомПор=\"2\" РегНомТД=\"23456789008767546345678977654\" НалБазаОпПдтв=\"43254363.59\"/>\n" +
                "\t\t</РеестрТД_1>\n" +
                "\t\t<РеестрТД_1 КодОпер=\"1010410\" НалБазаИт=\"9857667419\">\n" +
                "\t\t\t<СведТД НомПор=\"1\" РегНомТД=\"3245678970-09876543354678980-\" НалБазаОпПдтв=\"909876\"/>\n" +
                "\t\t\t<СведТД НомПор=\"2\" РегНомТД=\"43567988909-09876543435446798\" НалБазаОпПдтв=\"9856757543\"/>\n" +
                "\t\t</РеестрТД_1>\n" +
                "\t</Документ>\n" +
                "</Файл>\n";
        nomKorr++;

        //УНД
        guid = UUID.randomUUID();
        common = no+"_"+no+"_"+inn+kpp+"_20200510_"+guid;
        File dirYnd = new File(dir, ("Ynd_" + no + "_v" +nomKorr + "_" + guid));
        File ndy = new File(dirYnd, ("NO_NDS_"+common+".xml"));
        File nd8y = new File(dirYnd, ("NO_NDS.8_"+common+".xml"));
        File nd9y = new File(dirYnd, ("NO_NDS.9_"+common+".xml"));

        dirYnd.mkdir();
        ndy.createNewFile();
        nd8y.createNewFile();
        nd9y.createNewFile();

        String fwy = "<?xml version=\"1.0\" encoding=\"windows-1251\"?>\n"+
                "<Файл ИдФайл=\""+ndy.getName().replaceFirst("[.][^.]+$", "")+"\" ВерсПрог=\"КОНТУР-ЭКСТЕРН, ВЕРСИЯ 14.0\" ВерсФорм=\"5.06\" ПризнНал8-12=\"1\" ПризнНал8=\"1\" ПризнНал81=\"0\" ПризнНал9=\"1\" ПризнНал91=\"0\" ПризнНал10=\"0\" ПризнНал11=\"0\" ПризнНал12=\"0\">\n"+
                "\t<Документ КНД=\"1151001\" ДатаДок=\"10.05.2020\" Период=\"24\" ОтчетГод=\"2019\" КодНО=\""+no+"\" НомКорр=\""+nomKorr+"\" ПоМесту=\"214\">\n" +
                "\t\t<СвНП ОКВЭД=\"41.20\">\n" +
                "\t\t\t<НПЮЛ НаимОрг=\"АО РОССИЙСКИЙ ЭКСПОРТНЫЙ ЦЕНТР\" ИННЮЛ=\""+inn+"\" КПП=\""+kpp+"\"/>\n"+
                "\t\t</СвНП>\n" +
                "\t\t<Подписант ПрПодп=\"1\">\n" +
                "\t\t\t<ФИО Фамилия=\"Богданов\" Имя=\"Иван\" Отчество=\"Иосифович\"/>\n" +
                "\t\t</Подписант>\n" +
                "\t\t<НДС>\n" +
                "\t\t\t<СумУплНП ОКТМО=\"77000000\" КБК=\"18210301000011000110\" СумПУ_173.1=\"9901355208\"/>\n" +
                "\t\t\t<НалПодтв0 СумИсчислИтог=\"0\">\n" +
                "\t\t\t\t<СумОпер4 КодОпер=\"1011410\" НалБаза=\"43687789\"/>\n" +
                "\t\t\t\t<СумОпер4 КодОпер=\"1010410\" НалБаза=\"9857667419\"/>\n" +
                "\t\t\t</НалПодтв0>\n" +
                "\t\t\t<КнигаПокуп НаимКнПок=\""+nd8y.getName()+"\"/>\n" +
                "\t\t\t<КнигаПрод НаимКнПрод=\""+nd9y.getName()+"\"/>\n" +
                "\t\t</НДС>\n" +
                "\t</Документ>\n" +
                "</Файл>";

        String fw1y = "<?xml version=\"1.0\" encoding=\"windows-1251\"?>\n" +
                "<Файл ИдФайл=\""+nd8y.getName().replaceFirst("[.][^.]+$", "")+"\" ВерсПрог=\"КОНТУР-ЭКСТЕРН, ВЕРСИЯ 14.0\" ВерсФорм=\"5.06\">\n" +
                "\t<Документ Индекс=\"0000080\" НомКорр=\""+nomKorr+"\" ПризнСвед8=\"1\"/>\n" +
                "</Файл>";

        String fw2y = "<?xml version=\"1.0\" encoding=\"windows-1251\"?>\n" +
                "<Файл ИдФайл=\""+nd9y.getName().replaceFirst("[.][^.]+$", "")+"\" ВерсПрог=\"КОНТУР-ЭКСТЕРН, ВЕРСИЯ 14.0\" ВерсФорм=\"5.06\">\n" +
                "\t<Документ Индекс=\"0000090\" НомКорр=\""+nomKorr+"\" ПризнСвед9=\"1\"/>\n" +
                "</Файл>";

        //УР на НД
        guid = UUID.randomUUID();
        common = no+"_"+no+"_"+inn+kpp+"_20200510_"+guid;
        File dirYr = new File(dir, ("YR_" + no + "_v" +nomKorr + "_" + guid));
        File reestry = new File(dirYr, ("KO_RRTDNDS_"+common+".xml"));
        File reestr2y = new File(dirYr, ("KO_RRTDNDS.2_"+common+".xml"));

        String fw3y = "<?xml version=\"1.0\" encoding=\"windows-1251\"?>\n" +
                "<Файл xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" ИдФайл=\""+reestry.getName().replaceFirst("[.][^.]+$", "")+"\" ВерсПрог=\"Налогоплательщик ЮЛ 4.66\" ВерсФорм=\"5.03\">\n" +
                "\t<Документ КНД=\"1155110\" ДатаДок=\"10.05.2020\" КодНО=\""+no+"\" Период=\"24\" ОтчетГод=\"2019\" ИмяФайлНДС=\""+nd.getName().replaceFirst("[.][^.]+$", "")+"\" НомКорр=\""+nomKorr+"\" НаимРеестрТД_1=\""+reestr2y.getName()+"\">\n" +
                "\t\t<СвНП>\n" +
                "\t\t\t<НПЮЛ НаимОрг=\"АО РОССИЙСКИЙ ЭКСПОРТНЫЙ ЦЕНТР\" ИННЮЛ=\""+inn+"\" КПП=\""+kpp+"\"/>\n" +
                "\t\t</СвНП>\n" +
                "\t\t<Подписант ПрПодп=\"1\" Тлф=\"88005553535\">\n" +
                "\t\t\t<ФИО Фамилия=\"Богданов\" Имя=\"Иван\" Отчество=\"Иосифович\"/>\n" +
                "\t\t</Подписант>\n" +
                "\t\t<РеестрТД_1 КодОпер=\"1011410\" НалБазаИт=\"43687789\"/>\n" +
                "\t\t<РеестрТД_1 КодОпер=\"1010410\" НалБазаИт=\"9857667419\"/>\n" +
                "\t</Документ>\n" +
                "</Файл>\n";

        String fw4y = "<?xml version=\"1.0\" encoding=\"windows-1251\"?>\n" +
                "<Файл xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" ИдФайл=\""+reestr2y.getName().replaceFirst("[.][^.]+$", "")+"\" ВерсПрог=\"Налогоплательщик ЮЛ 4.66\" ВерсФорм=\"5.03\">\n" +
                "\t<Документ Индекс=\"0005110\" НомКорр=\""+nomKorr+"\">\n" +
                "\t\t<РеестрТД_1 КодОпер=\"1011410\" НалБазаИт=\"43687789\">\n" +
                "\t\t\t<СведТД НомПор=\"1\" РегНомТД=\"121321124432536780p9876543678\" НалБазаОпПдтв=\"433425.41\"/>\n" +
                "\t\t\t<СведТД НомПор=\"2\" РегНомТД=\"23456789008767546345678977654\" НалБазаОпПдтв=\"43254363.59\"/>\n" +
                "\t\t</РеестрТД_1>\n" +
                "\t\t<РеестрТД_1 КодОпер=\"1010410\" НалБазаИт=\"9857667419\">\n" +
                "\t\t\t<СведТД НомПор=\"1\" РегНомТД=\"3245678970-09876543354678980-\" НалБазаОпПдтв=\"909876\"/>\n" +
                "\t\t\t<СведТД НомПор=\"2\" РегНомТД=\"43567988909-09876543435446798\" НалБазаОпПдтв=\"9856757543\"/>\n" +
                "\t\t</РеестрТД_1>\n" +
                "\t</Документ>\n" +
                "</Файл>\n";

        dirYr.mkdir();
        reestry.createNewFile();
        reestr2y.createNewFile();

        //УР на УНД

        fileWriter(nd,fw);
        fileWriter(nd8,fw1);
        fileWriter(nd9,fw2);
        fileWriter(reestr,fw3);
        fileWriter(reestr2,fw4);
        fileWriter(ndy,fwy);
        fileWriter(nd8y,fw1y);
        fileWriter(nd9y,fw2y);
        fileWriter(reestry,fw3y);
        fileWriter(reestr2y,fw4y);

    }

    public static void fileWriter(File f, String s) throws IOException {
        OutputStreamWriter writer = new OutputStreamWriter(new FileOutputStream(f, true), "windows-1251");
        writer.append(s);
        writer.close();

    }


}


